In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
dframe = pd.read_csv('test1.csv')
dframe

   1   2   a    apple
0  4   b   3     pear
1  2   4   5   banana

In [5]:
dframe = pd.read_csv('test1.csv', header = None)
dframe

   0   1   2        3
0  1   2   a    apple
1  4   b   3     pear
2  2   4   5   banana

In [7]:
dframe = pd.read_table('test1.csv', sep=',' , header=None)  #seperator is the ,
dframe

   0   1   2        3
0  1   2   a    apple
1  4   b   3     pear
2  2   4   5   banana

In [16]:
pd.read_csv('test1.csv', header=None , nrows = 2)

   0   1   2       3
0  1   2   a   apple
1  4   b   3    pear

In [9]:
dframe.to_csv('myTextfile.csv')  #exporting a dataframe into a csv file

In [10]:
import sys

In [12]:
dframe.to_csv(sys.stdout)

,0,1,2,3
0,1, 2, a, apple
1,4, b, 3, pear
2,2, 4, 5, banana

In [14]:
dframe.to_csv(sys.stdout, sep='_')

_0_1_2_3
0_1_ 2_ a_ apple
1_4_ b_ 3_ pear
2_2_ 4_ 5_ banana

In [17]:
dframe.to_csv(sys.stdout, columns=[0,1,2])

,0,1,2
0,1, 2, a
1,4, b, 3
2,2, 4, 5